In [1]:
import matplotlib.pyplot as plt
import numpy
import pandas as pd

import seaborn
seaborn.set_context('talk')

from sqlalchemy import create_engine, text

**Diplomatura en Ciencia de Datos, Aprendizaje Automático y sus Aplicaciones**

**Exploración y Curación de Datos**

*Edición 2023*

----

# Trabajo práctico entregable - parte 1

En esta notebook, vamos a cargar el conjunto de datos de [la compentencia Kaggle](https://www.kaggle.com/dansbecker/melbourne-housing-snapshot) sobre estimación de precios de ventas de propiedades en Melbourne, Australia.

Utilizaremos el conjunto de datos reducido producido por [DanB](https://www.kaggle.com/dansbecker). Hemos subido una copia a un servidor de la Universidad Nacional de Córdoba para facilitar su acceso remoto.

In [2]:
import plotly
plotly.__version__

'5.14.1'

In [3]:
df_melb = pd.read_csv(
    'https://cs.famaf.unc.edu.ar/~mteruel/datasets/diplodatos/melb_data.csv')
df_melb[:3]

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0

In [4]:
df_melb.columns

Index(['Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'SellerG',
       'Date', 'Distance', 'Postcode', 'Bedroom2', 'Bathroom', 'Car',
       'Landsize', 'BuildingArea', 'YearBuilt', 'CouncilArea', 'Lattitude',
       'Longtitude', 'Regionname', 'Propertycount'],
      dtype='object')

## Ejercicio 1 SQL: 

1. Crear una base de datos en SQLite utilizando la libreria [SQLalchemy](https://stackoverflow.com/questions/2268050/execute-sql-from-file-in-sqlalchemy).
https://docs.sqlalchemy.org/en/14/core/engines.html#sqlite

2. Ingestar los datos provistos en 'https://cs.famaf.unc.edu.ar/~mteruel/datasets/diplodatos/melb_data.csv' en una tabla y el dataset generado en clase con datos de airbnb y sus precios por codigo postal en otra.

3. Implementar consultas en SQL que respondan con la siguiente información:

    - cantidad de registros totales por ciudad.
    - cantidad de registros totales por barrio y ciudad.

4. Combinar los datasets de ambas tablas ingestadas utilizando el comando JOIN de SQL  para obtener un resultado similar a lo realizado con Pandas en clase.

#### 1.

**creacion de base de datos**

In [5]:
engine = create_engine('sqlite:///DataBase.sqlite3', echo=True)   #create database file called 'DataBase.sqlite3' where
                                                                  #the two tables are going
                                                                  #to be stored.

### 2.
**Ingestando las tablas**

In [6]:
df_airbnb = pd.read_csv("airbnb_price_by_zipcode.csv")
df_airbnb.head(200)

,zipcode,airbnb_price_mean,airbnb_record_count,airbnb_weekly_price_mean,airbnb_monthly_price_mean
0,2010.0,40.000000,1,NaN,NaN
1,2134.0,50.000000,1,NaN,NaN
2,2582.0,104.000000,1,NaN,NaN
3,3000.0,150.504307,3367,918.738956,3407.204651
4,3001.0,132.500000,2,NaN,NaN
...,...,...,...,...,...
195,3767.0,215.666667,42,814.000000,2784.500000
196,3770.0,396.166667,24,1050.000000,3200.000000
197,3775.0,337.688889,45,733.166667,2800.000000
198,3777.0,271.256684,187,1278.512195,3802.187500
199,3778.0,163.000000,1,NaN,NaN

In [7]:
df_melb.to_sql('melb_data', con=engine, if_exists="replace")      #create table named 'melb_data' into 'Database.sqlite3' file
df_airbnb.to_sql('airbnb_data', con=engine, if_exists="replace")    #create table named 'airbnb_data'  into 'Database.sqlite3' file

2023-06-03 09:49:08,489 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-06-03 09:49:08,495 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("melb_data")
2023-06-03 09:49:08,495 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,497 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("melb_data")
2023-06-03 09:49:08,498 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,499 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2023-06-03 09:49:08,500 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,501 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_temp_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2023-06-03 09:49:08,502 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,503 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("melb_data")
2023-06-03 09:49:08,504 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,506 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2023-06-03 09:49:08,506 INFO sqlalchemy.engine.Engine [raw sql] ('melb_data',)
2023-06-03 09:49:08,508 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("melb_data")
2023-06-03 09:49:08,509 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,510 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("melb_data")
2023-06-03 09:49:08,511 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,513 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2023-06-03 09:49:08,514 INFO sqlalchemy.engine.Engine [raw sql] ('melb_data',)
2023-06-03 09:49:08,519 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("melb_data")
2023-06-03 09:49:08,520 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,522 INFO sqlalchemy.engine.Engine PRAGMA main.index_info("ix_melb_data_index")
2023-06-03 09:49:08,523 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,525 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("melb_data")
2023-06-03 09:49:08,526 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,527 INFO sqlalchemy.engine.Engine PRAGMA main.index_info("ix_melb_data_index")
2023-06-03 09:49:08,528 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,529 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2023-06-03 09:49:08,530 INFO sqlalchemy.engine.Engine [raw sql] ('melb_data',)
2023-06-03 09:49:08,536 INFO sqlalchemy.engine.Engine
DROP TABLE melb_data
2023-06-03 09:49:08,537 INFO sqlalchemy.engine.Engine [no key 0.00088s] ()
2023-06-03 09:49:08,556 INFO sqlalchemy.engine.Engine
CREATE TABLE melb_data (
	"index" BIGINT,
	"Suburb" TEXT,
	"Address" TEXT,
	"Rooms" BIGINT,
	"Type" TEXT,
	"Price" FLOAT,
	"Method" TEXT,
	"SellerG" TEXT,
	"Date" TEXT,
	"Distance" FLOAT,
	"Postcode" FLOAT,
	"Bedroom2" FLOAT,
	"Bathroom" FLOAT,
	"Car" FLOAT,
	"Landsize" FLOAT,
	"BuildingArea" FLOAT,
	"YearBuilt" FLOAT,
	"CouncilArea" TEXT,
	"Lattitude" FLOAT,
	"Longtitude" FLOAT,
	"Regionname" TEXT,
	"Propertycount" FLOAT
)


2023-06-03 09:49:08,557 INFO sqlalchemy.engine.Engine [no key 0.00082s] ()
2023-06-03 09:49:08,562 INFO sqlalchemy.engine.Engine CREATE INDEX ix_melb_data_index ON melb_data ("index")
2023-06-03 09:49:08,563 INFO sqlalchemy.engine.Engine [no key 0.00110s] ()
2023-06-03 09:49:08,767 INFO sqlalchemy.engine.Engine INSERT INTO melb_data ("index", "Suburb", "Address", "Rooms", "Type", "Price", "Method", "SellerG", "Date", "Distance", "Postcode", "Bedroom2", "Bathroom", "Car", "Landsize", "BuildingArea", "YearBuilt", "CouncilArea", "Lattitude", "Longtitude", "Regionname", "Propertycount") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2023-06-03 09:49:08,768 INFO sqlalchemy.engine.Engine [generated in 0.14456s] [(0, 'Abbotsford', '85 Turner St', 2, 'h', 1480000.0, 'S', 'Biggin', '3/12/2016', 2.5, 3067.0, 2.0, 1.0, 1.0, 202.0, None, None, 'Yarra', -37.7996, 144.9984, 'Northern Metropolitan', 4019.0), (1, 'Abbotsford', '25 Bloomburg St', 2, 'h', 1035000.0, 'S', 'Biggin', '4/02/2016', 2.5, 3067.0, 2.0, 1.0, 0.0, 156.0, 79.0, 1900.0, 'Yarra', -37.8079, 144.9934, 'Northern Metropolitan', 4019.0), (2, 'Abbotsford', '5 Charles St', 3, 'h', 1465000.0, 'SP', 'Biggin', '4/03/2017', 2.5, 3067.0, 3.0, 2.0, 0.0, 134.0, 150.0, 1900.0, 'Yarra', -37.8093, 144.9944, 'Northern Metropolitan', 4019.0), (3, 'Abbotsford', '40 Federation La', 3, 'h', 850000.0, 'PI', 'Biggin', '4/03/2017', 2.5, 3067.0, 3.0, 2.0, 1.0, 94.0, None, None, 'Yarra', -37.7969, 144.9969, 'Northern Metropolitan', 4019.0), (4, 'Abbotsford', '55a Park St', 4, 'h', 1600000.0, 'VB', 'Nelson', '4/06/2016', 2.5, 3067.0, 3.0, 1.0, 2.0, 120.0, 142.0, 2014.0, 'Yarra', -37.8072, 144.9941, 'Northern Metropolitan', 4019.0), (5, 'Abbotsford', '129 Charles St', 2, 'h', 941000.0, 'S', 'Jellis', '7/05/2016', 2.5, 3067.0, 2.0, 1.0, 0.0, 181.0, None, None, 'Yarra', -37.8041, 144.9953, 'Northern Metropolitan', 4019.0), (6, 'Abbotsford', '124 Yarra St', 3, 'h', 1876000.0, 'S', 'Nelson', '7/05/2016', 2.5, 3067.0, 4.0, 2.0, 0.0, 245.0, 210.0, 1910.0, 'Yarra', -37.8024, 144.9993, 'Northern Metropolitan', 4019.0), (7, 'Abbotsford', '98 Charles St', 2, 'h', 1636000.0, 'S', 'Nelson', '8/10/2016', 2.5, 3067.0, 2.0, 1.0, 2.0, 256.0, 107.0, 1890.0, 'Yarra', -37.806, 144.9954, 'Northern Metropolitan', 4019.0)  ... displaying 10 of 13580 total bound parameter sets ...  (13578, 'Williamstown', '96 Verdon St', 4, 'h', 2500000.0, 'PI', 'Sweeney', '26/08/2017', 6.8, 3016.0, 4.0, 1.0, 5.0, 866.0, 157.0, 1920.0, None, -37.85908, 144.89299, 'Western Metropolitan', 6380.0), (13579, 'Yarraville', '6 Agnes St', 4, 'h', 1285000.0, 'SP', 'Village', '26/08/2017', 6.3, 3013.0, 4.0, 1.0, 1.0, 362.0, 112.0, 1920.0, None, -37.81188, 144.88449, 'Western Metropolitan', 6543.0)]
2023-06-03 09:49:08,846 INFO sqlalchemy.engine.Engine COMMIT
2023-06-03 09:49:08,851 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-06-03 09:49:08,853 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("airbnb_data")
2023-06-03 09:49:08,855 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,857 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("airbnb_data")
2023-06-03 09:49:08,858 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,859 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2023-06-03 09:49:08,860 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,862 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_temp_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2023-06-03 09:49:08,863 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,865 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("airbnb_data")
2023-06-03 09:49:08,866 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,868 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2023-06-03 09:49:08,870 INFO sqlalchemy.engine.Engine [raw sql] ('airbnb_data',)
2023-06-03 09:49:08,872 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("airbnb_data")
2023-06-03 09:49:08,873 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,874 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("airbnb_data")
2023-06-03 09:49:08,875 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,876 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2023-06-03 09:49:08,878 INFO sqlalchemy.engine.Engine [raw sql] ('airbnb_data',)
2023-06-03 09:49:08,880 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("airbnb_data")

2023-06-03 09:49:08,881 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,882 INFO sqlalchemy.engine.Engine PRAGMA main.index_info("ix_airbnb_data_index")
2023-06-03 09:49:08,884 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,886 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("airbnb_data")
2023-06-03 09:49:08,888 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,889 INFO sqlalchemy.engine.Engine PRAGMA main.index_info("ix_airbnb_data_index")
2023-06-03 09:49:08,890 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-03 09:49:08,892 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2023-06-03 09:49:08,893 INFO sqlalchemy.engine.Engine [raw sql] ('airbnb_data',)
2023-06-03 09:49:08,896 INFO sqlalchemy.engine.Engine
DROP TABLE airbnb_data
2023-06-03 09:49:08,897 INFO sqlalchemy.engine.Engine [no key 0.00088s] ()
2023-06-03 09:49:08,902 INFO sqlalchemy.engine.Engine
CREATE TABLE airbnb_data (
	"index" BIGINT,
	zipcode FLOAT,
	airbnb_price_mean FLOAT,
	airbnb_record_count BIGINT,
	airbnb_weekly_price_mean FLOAT,
	airbnb_monthly_price_mean FLOAT
)


2023-06-03 09:49:08,903 INFO sqlalchemy.engine.Engine [no key 0.00108s] ()
2023-06-03 09:49:08,909 INFO sqlalchemy.engine.Engine CREATE INDEX ix_airbnb_data_index ON airbnb_data ("index")
2023-06-03 09:49:08,910 INFO sqlalchemy.engine.Engine [no key 0.00132s] ()
2023-06-03 09:49:08,919 INFO sqlalchemy.engine.Engine INSERT INTO airbnb_data ("index", zipcode, airbnb_price_mean, airbnb_record_count, airbnb_weekly_price_mean, airbnb_monthly_price_mean) VALUES (?, ?, ?, ?, ?, ?)
2023-06-03 09:49:08,921 INFO sqlalchemy.engine.Engine [generated in 0.00455s] [(0, 2010.0, 40.0, 1, None, None), (1, 2134.0, 50.0, 1, None, None), (2, 2582.0, 104.0, 1, None, None), (3, 3000.0, 150.5043065043065, 3367, 918.7389558232932, 3407.204651162791), (4, 3001.0, 132.5, 2, None, None), (5, 3002.0, 200.9796954314721, 197, 956.3793103448276, 3712.714285714286), (6, 3003.0, 130.20599250936328, 267, 760.2, 2629.5), (7, 3004.0, 158.271978021978, 728, 1061.1714285714286, 3759.925925925926)  ... displaying 10 of 247 total bound parameter sets ...  (245, 9540.0, 245.0, 1, None, None), (246, 30122.0, 75.0, 1, 525.0, 2281.0)]
2023-06-03 09:49:08,925 INFO sqlalchemy.engine.Engine COMMIT

247

### 3.
- cantidad de registros totales por ciudad.

In [8]:
query1 = "SELECT CouncilArea, COUNT(*) FROM melb_data GROUP BY CouncilArea"

In [9]:
with engine.connect() as con:
      rs = con.execute(text(query1))
      df_rs = pd.DataFrame(rs.fetchall())  #inserting list of tuples (query return) into a DataFrame object for visualization
      for row in rs:
          print(row)

2023-06-03 09:49:08,950 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-06-03 09:49:08,955 INFO sqlalchemy.engine.Engine SELECT CouncilArea, COUNT(*) FROM melb_data GROUP BY CouncilArea
2023-06-03 09:49:08,957 INFO sqlalchemy.engine.Engine [generated in 0.00714s] ()
2023-06-03 09:49:08,968 INFO sqlalchemy.engine.Engine ROLLBACK

In [10]:
df_rs.head(10)  #displaying result of query 1

  CouncilArea  COUNT(*)
0        None      1369
1     Banyule       594
2     Bayside       489
3  Boroondara      1160
4    Brimbank       424
5    Cardinia         8
6       Casey        38
7     Darebin       934
8   Frankston        53
9   Glen Eira       848

- cantidad de registros totales por barrio y ciudad.

In [11]:
query2 = "SELECT Suburb, CouncilArea, COUNT(*) FROM melb_data GROUP BY Suburb"

In [12]:
with engine.connect() as con:
      request2 = con.execute(text(query2))
      df_request2 = pd.DataFrame(request2.fetchall())  #inserting list of tuples (query return) into a DataFrame object for visualization
      for row in request2:
          print(row)

2023-06-03 09:49:08,997 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-06-03 09:49:08,999 INFO sqlalchemy.engine.Engine SELECT Suburb, CouncilArea, COUNT(*) FROM melb_data GROUP BY Suburb
2023-06-03 09:49:09,000 INFO sqlalchemy.engine.Engine [generated in 0.00366s] ()
2023-06-03 09:49:09,016 INFO sqlalchemy.engine.Engine ROLLBACK

In [13]:
df_request2.head(20)

               Suburb    CouncilArea  COUNT(*)
0          Abbotsford          Yarra        56
1          Aberfeldie  Moonee Valley        44
2        Airport West  Moonee Valley        67
3           Albanvale       Brimbank         6
4         Albert Park   Port Phillip        69
5              Albion       Brimbank        41
6          Alphington        Darebin        34
7              Altona    Hobsons Bay        74
8      Altona Meadows    Hobsons Bay         6
9        Altona North    Hobsons Bay        56
10             Ardeer       Brimbank         3
11           Armadale    Stonnington        95
12         Ascot Vale  Moonee Valley       130
13          Ashburton     Boroondara        60
14            Ashwood         Monash        46
15          Aspendale       Kingston         7
16  Aspendale Gardens       Kingston         4
17            Attwood           None         1
18   Avondale Heights  Moonee Valley        74
19      Bacchus Marsh      Moorabool         1

### 4.
**Join**

In [14]:
query3 = """SELECT *

            FROM
                 melb_data
            LEFT JOIN airbnb_data ON
                melb_data.Postcode = airbnb_data.zipcode
         """

In [15]:
with engine.connect() as con:
      request3 = con.execute(text(query3))
      df_Joined = pd.DataFrame(request3.fetchall()) #inserting list of tuples (query return) into a DataFrame object for visualization
      for row in request3:
          print(row)

2023-06-03 09:49:09,041 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-06-03 09:49:09,043 INFO sqlalchemy.engine.Engine SELECT *

            FROM
                 melb_data
            LEFT JOIN airbnb_data ON
                melb_data.Postcode = airbnb_data.zipcode

2023-06-03 09:49:09,045 INFO sqlalchemy.engine.Engine [generated in 0.00376s] ()
2023-06-03 09:49:09,203 INFO sqlalchemy.engine.Engine ROLLBACK

In [16]:
df_Joined[['zipcode','Postcode']].head(10)  #checking for succesful pairing

   zipcode  Postcode
0   3067.0    3067.0
1   3067.0    3067.0
2   3067.0    3067.0
3   3067.0    3067.0
4   3067.0    3067.0
5   3067.0    3067.0
6   3067.0    3067.0
7   3067.0    3067.0
8   3067.0    3067.0
9   3067.0    3067.0

In [19]:
# A more robust checking

zipcode_postcode_matching = pd.DataFrame()
zipcode_postcode_matching['match'] = pd.Series(df_Joined['zipcode'] == df_Joined['Postcode'])

number_of_elements = zipcode_postcode_matching.shape[0]
number_of_matchs = zipcode_postcode_matching.loc[zipcode_postcode_matching['match']].shape[0]

print(f'Total number of elements: {number_of_elements}')
print(f'Total number of matchs: {number_of_matchs}')
zipcode_postcode_matching.loc[~zipcode_postcode_matching['match']]

Total number of elements: 13580
Total number of matchs: 13560

       match
6817   False
6818   False
8717   False
8817   False
9549   False
10033  False
10576  False
10938  False
11032  False
11371  False
11372  False
11572  False
11877  False
12503  False
12504  False
12728  False
12865  False
12890  False
12927  False
13245  False

## Ejercicio 2 - Pandas: 

1. Seleccionar un subconjunto de columnas que les parezcan relevantes al problema de predicción del valor de la propiedad. Justificar las columnas seleccionadas y las que no lo fueron.
 - Eliminar los valores extremos que no sean relevantes para la predicción de valores de las propiedades.

 
2. Agregar información adicional respectiva al entorno de una propiedad a partir del [conjunto de datos de AirBnB](https://www.kaggle.com/tylerx/melbourne-airbnb-open-data?select=cleansed_listings_dec18.csv) utilizado en el práctico. 
  1. Seleccionar qué variables agregar y qué combinaciones aplicar a cada una. Por ejemplo, pueden utilizar solo la columna `price`, o aplicar múltiples transformaciones como la mediana o el mínimo.
  1. Utilizar la variable zipcode para unir los conjuntos de datos. Sólo incluir los zipcodes que tengan una cantidad mínima de registros (a elección) como para que la información agregada sea relevante.
  2. Investigar al menos otras 2 variables que puedan servir para combinar los datos, y justificar si serían adecuadas o no. Pueden asumir que cuentan con la ayuda de anotadores expertos para encontrar equivalencias entre barrios o direcciones, o que cuentan con algoritmos para encontrar las n ubicaciones más cercanas a una propiedad a partir de sus coordenadas geográficas. **NO** es necesario que realicen la implementación.

Pueden leer otras columnas del conjunto de AirBnB además de las que están en `interesting_cols`, si les parecen relevantes.

## Ejercicio 3:

Crear y guardar un nuevo conjunto de datos con todas las transformaciones realizadas anteriormente.

## Ejercicios opcionales:

1. Armar un script en python (archivo .py) [ETL](https://towardsdatascience.com/what-to-log-from-python-etl-pipelines-9e0cfe29950e) que corra los pasos de extraccion, transformacion y carga, armando una funcion para cada etapa del proceso y luego un main que corra todos los pasos requeridos.

2. Armar un DAG en Apache Airflow que corra el ETL. (https://airflow.apache.org/docs/apache-airflow/stable/tutorial.html)